tap "anomalyco/tap"
tap "zzet/tap"

# Core shell / dotfiles
brew "atuin"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "ripgrep"
brew "starship"
brew "zinit"
brew "zoxide"
brew "yq"

# Dev essentials
brew "gh"
brew "go"
brew "nvm"
brew "uv"
brew "shellcheck"

# Infra / cloud
brew "ansible"
brew "azure-cli"
brew "dagger"
brew "hcloud"
brew "trivy"

# Docs / diagrams
brew "graphviz"
brew "pandoc"
brew "plantuml"

# AI / coding tools
brew "anomalyco/tap/opencode", trusted: true
cask "codex"
cask "claude"

# Apps
cask "1password-cli"
cask "dotnet-sdk"
cask "ghostty"

# Language/package-managed tools
go "golang.org/x/tools/gopls"
npm "@anthropic-ai/claude-code"
