tap "1password/tap"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "isen-ng/dotnet-sdk-versions"
tap "pulumi/tap"
brew "azure-cli"
brew "direnv"
brew "git"
brew "neovim"
brew "openjdk"
brew "terraform"
brew "wireguard-tools"
brew "go"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "cleanmymac"
cask "docker"
cask "dotnet-sdk8-0-100"
cask "drawio"
cask "intellij-idea"
cask "iterm2"
cask "microsoft-edge"
cask "obsidian"
cask "onedrive"
cask "remnote"
cask "rider"
cask "todoist"
cask "visual-studio-code"
cask "xmind"
cask "nordvpn"
